; domain
(define (domain assignment_problem_1)
    (:requirements :strips :typing :negative-preconditions)

    (:types
        location - object; defines a location
        work_station - object ; defines a work station
        box - object ; defines a box
        supply - object ; defines a general supply, will be extended
        robot - object ; defines a robot
        valve - supply ; defines a valve, inherits from supply
        bolt - supply ; defines a bolt, inherits from supply
        tool - supply ; defines a tool, inherits from supply
        warehouse - location ; defines a warehouse, inherits from location
        
        )
    (:constants
   
    )


    (:predicates
        
        (atwa ?x - warehouse ?l - location) ; Defines where the warehouse is
        (atws ?x - work_station ?l - location) ; Defines where the work station is
        (atbl ?x - box ?l - location) ; Defines where the box is
        (atbw ?x - box ?l - work_station) ; Defines where the box is
        (ats ?x - supply ?l - location) ; Defines where the supply is
        (atr ?x - robot ?l - location) ; Defines where the robot is
        (contains ?x - box ?y - supply) ; Defines what the box contains

        (has ?ws - work_station ?s - supply) ; Defines what the work station has
        (box_delivered ?b - box ?ws - work_station) ; Defines what boxes have been delivered to the work station


        (carries ?r - robot ?b - box) ; Defines what the robot carries

        (connected ?l1 - location ?l2 - location) ; Defines what locations are connected
        
        (free ?l - location)
        (loaded ?r - robot) ; defines if a robot is loaded
        (empty ?b - box) ; defines if a box is empty
        (has_bolt ?ws - work_station) ; defines if a work station has a bolt
        (has_tool ?ws - work_station) ; defines if a work station has a bolt
        (has_valve ?ws - work_station) ; defines if a work station has a bolt

        (is_bolt ?b - supply) ; used as a flag to check if a supply is a bolt
        (is_valve ?b - supply) ; used as a flag to check if a supply is a valve
        (is_tool ?b - supply) ; used as a flag to check if a supply is a tool 

    
    )

    ; moves a robot from one location to another
    (:action move_robot
        :parameters (?r - robot ?l1 - location ?l2 - location)
        :precondition (and (atr ?r ?l1) (connected ?l1 ?l2) (free ?l2) (not (loaded ?r)))
        :effect (and  (not (free ?l2)) (free ?l1) (atr ?r ?l2) (not (atr ?r ?l1)))
    )

    ; moves a robot from one location to another while carrying a box
     (:action move_box_and_robot
        :parameters (?r - robot ?l1 - location ?l2 - location ?b - box)
        :precondition (and (atr ?r ?l1) (connected ?l1 ?l2) (free ?l2) (loaded ?r) (carries ?r ?b) )
        :effect (and  (not (free ?l2)) (free ?l1) (atr ?r ?l2) (not (atr ?r ?l1)) (atbl ?b ?l2) )
    )

    ; pick up a box from a location and loads it on a robot
    (:action pick_box_from_location
        :parameters (?r - robot ?b - box ?l - location)
        :precondition (and (atr ?r ?l) (atbl ?b ?l) (not (loaded ?r)))
        :effect (and  (not (atbl ?b ?l)) (carries ?r ?b) (loaded ?r))
    )
    ; delivers the box to the work station
    (:action deliver_box_to_ws
        :parameters (?r - robot ?b - box ?ws - work_station ?l - location ?s - supply)
        :precondition (and (atr ?r ?l) (atws ?ws ?l) (loaded ?r) (carries ?r ?b) (contains ?b ?s) )
        :effect (and (not(loaded ?r)) (not(carries ?r ?b)) (atbw ?b ?ws) (not(atbl ?b ?l)) (box_delivered ?b ?ws) (ats ?s ?l) )
    )
    ; fills a box with a supply
    (:action fill_box
        :parameters (?r - robot ?b - box ?s - supply ?l - location) 
        :precondition (and (atbl ?b ?l) (atr ?r ?l) (empty ?b) (ats ?s ?l) )
        :effect (and (contains ?b ?s) (not (empty ?b)) (not (ats ?s ?l)))
    )

    ; empties a box that has been delivered to a work station and assigns the supply to the workstation
    (:action empty_box
        :parameters (?r - robot ?b - box ?s - supply ?l - location ?ws - work_station)
        :precondition (and (atr ?r ?l) (atws ?ws ?l) (contains ?b ?s) (ats ?s ?l) (box_delivered ?b ?ws) (ats ?s ?l) (not (loaded ?r)) )
        :effect (and (not (contains ?b ?s)) (empty ?b) (has ?ws ?s) (not (ats ?s ?l)) )
    )



    ; used to trigger the goal predicates once a supply reaches a work station
    (:action bolt_acquired
        :parameters (?ws - work_station ?s - supply)
        :precondition (and (has ?ws ?s) (is_bolt ?s))
        :effect (and (has_bolt ?ws))
    )
    (:action tool_acquired
        :parameters (?ws - work_station ?s - supply)
        :precondition (and (has ?ws ?s) (is_tool ?s))
        :effect (and (has_tool ?ws))
    )
    (:action valve_acquired
        :parameters (?ws - work_station ?s - supply)
        :precondition (and (has ?ws ?s) (is_valve ?s))
        :effect (and (has_valve ?ws))
    )

)

; problem
(define (problem problem_1) (:domain assignment_problem_1)
(:objects 
    r1 - robot
    l1 l2 l3 l4 -location
    centralwarehouse - warehouse
    b1 b2 b3 b4 b5 b6 - box
    valve1 valve2 valve3 valve4 valve5 valve6 - valve
    bolt1 bolt2 bolt3 bolt4 bolt5 bolt6 - bolt
    tool1 tool2 tool3 tool4 tool5 tool6 - tool
    ws1 ws2 ws3 ws4 ws5  - work_station

    )




   

(:init
    ; robot starts at central warehouse
    (atr r1 centralwarehouse)


    (free l1)
    (free l2)
    (free l3)
    (free l4)

    ; all supplies are at central warehouse
    (ats valve1 centralwarehouse)
    (ats valve2 centralwarehouse)
    (ats valve3 centralwarehouse)
    (ats valve4 centralwarehouse)
    (ats valve5 centralwarehouse)
    (ats valve6 centralwarehouse)
    (ats bolt1 centralwarehouse)
    (ats bolt2 centralwarehouse)
    (ats bolt3 centralwarehouse)
    (ats bolt4 centralwarehouse)
    (ats bolt5 centralwarehouse)
    (ats bolt6 centralwarehouse)
    (ats tool1 centralwarehouse)
    (ats tool2 centralwarehouse)
    (ats tool3 centralwarehouse)
    (ats tool4 centralwarehouse)
    (ats tool5 centralwarehouse)
    (ats tool6 centralwarehouse)
    (is_bolt bolt1)
    (is_bolt bolt2)
    (is_bolt bolt3)
    (is_bolt bolt4)
    (is_bolt bolt5)
    (is_bolt bolt6)
    (is_valve valve1)
    (is_valve valve2)
    (is_valve valve3)
    (is_valve valve4)
    (is_valve valve5)
    (is_valve valve6)
    (is_tool tool1)
    (is_tool tool2)
    (is_tool tool3)
    (is_tool tool4)
    (is_tool tool5)
    (is_tool tool6)






    ; all boxes are at central warehouse
    (atbl b1 centralwarehouse)
    (atbl b2 centralwarehouse)
    (atbl b3 centralwarehouse)
    (atbl b4 centralwarehouse)
    (atbl b5 centralwarehouse)
    (atbl b6 centralwarehouse)
    ; all boxes are empty
    (empty b1)
    (empty b2)
    (empty b3)
    (empty b4)
    (empty b5)
    (empty b6)

    ; create map
    (connected centralwarehouse l1)
    (connected centralwarehouse l2)
    (connected centralwarehouse l3)
    (connected l3 l4)
    (connected l4 l3)
    (connected l1 centralwarehouse)
    (connected l2 centralwarehouse)
    (connected l3 centralwarehouse)



    ; put workstation at location
    (atws ws1 l1)
    (atws ws2 l2)
    (atws ws3 l3)
    (atws ws4 l4)
    (atws ws5 l4)










)

(:goal (and

    (atr r1 centralwarehouse)
    (has_bolt ws3)
    (has_tool ws2)
    (has_bolt ws2)
    (has_valve ws1)
    ;todo: put the goal condition here
))

;un-comment the following line if metric is needed
;(:metric minimize (???))
)

; plan
1. (fill_box r1 b6 bolt1 centralwarehouse)
   deleted: (empty b6) (ats bolt1 centralwarehouse)
   added: (contains b6 bolt1)
   goals met: 1 of 5
2. (fill_box r1 b5 bolt5 centralwarehouse)
   deleted: (empty b5) (ats bolt5 centralwarehouse)
   added: (contains b5 bolt5)
   goals met: 1 of 5
3. (pick_box_from_location r1 b5 centralwarehouse)
   deleted: (atbl b5 centralwarehouse)
   added: (carries r1 b5) (loaded r1)
   goals met: 1 of 5
4. (fill_box r1 b3 tool6 centralwarehouse)
   deleted: (empty b3) (ats tool6 centralwarehouse)
   added: (contains b3 tool6)
   goals met: 1 of 5
5. (move_box_and_robot r1 centralwarehouse l2 b5)
   deleted: (free l2) (atr r1 centralwarehouse)
   added: (free centralwarehouse) (atr r1 l2) (atbl b5 l2)
   goals met: 0 of 5
6. (deliver_box_to_ws r1 b5 ws2 l2 bolt5)
   deleted: (loaded r1) (carries r1 b5) (atbl b5 l2)
   added: (atbw b5 ws2) (box_delivered b5 ws2) (ats bolt5 l2)
   goals met: 0 of 5
7. (empty_box r1 b5 bolt5 l2 ws2)
   deleted: (contains b5 bolt5) (ats bolt5 l2)
   added: (empty b5) (has ws2 bolt5)
   goals met: 0 of 5
8. (bolt_acquired ws2 bolt5)
   added: (has_bolt ws2)
   goals met: 1 of 5
9. (move_robot r1 l2 centralwarehouse)
   deleted: (free centralwarehouse) (atr r1 l2)
   added: (free l2) (atr r1 centralwarehouse)
   goals met: 2 of 5
10. (pick_box_from_location r1 b3 centralwarehouse)
   deleted: (atbl b3 centralwarehouse)
   added: (carries r1 b3) (loaded r1)
   goals met: 2 of 5
11. (move_box_and_robot r1 centralwarehouse l2 b3)
   deleted: (free l2) (atr r1 centralwarehouse)
   added: (free centralwarehouse) (atr r1 l2) (atbl b3 l2)
   goals met: 1 of 5
12. (deliver_box_to_ws r1 b3 ws2 l2 tool6)
   deleted: (loaded r1) (carries r1 b3) (atbl b3 l2)
   added: (atbw b3 ws2) (box_delivered b3 ws2) (ats tool6 l2)
   goals met: 1 of 5
13. (empty_box r1 b3 tool6 l2 ws2)
   deleted: (contains b3 tool6) (ats tool6 l2)
   added: (empty b3) (has ws2 tool6)
   goals met: 1 of 5
14. (move_robot r1 l2 centralwarehouse)
   deleted: (free centralwarehouse) (atr r1 l2)
   added: (free l2) (atr r1 centralwarehouse)
   goals met: 2 of 5
15. (fill_box r1 b4 valve1 centralwarehouse)
   deleted: (empty b4) (ats valve1 centralwarehouse)
   added: (contains b4 valve1)
   goals met: 2 of 5
16. (pick_box_from_location r1 b4 centralwarehouse)
   deleted: (atbl b4 centralwarehouse)
   added: (carries r1 b4) (loaded r1)
   goals met: 2 of 5
17. (move_box_and_robot r1 centralwarehouse l1 b4)
   deleted: (free l1) (atr r1 centralwarehouse)
   added: (free centralwarehouse) (atr r1 l1) (atbl b4 l1)
   goals met: 1 of 5
18. (deliver_box_to_ws r1 b4 ws1 l1 valve1)
   deleted: (loaded r1) (carries r1 b4) (atbl b4 l1)
   added: (atbw b4 ws1) (box_delivered b4 ws1) (ats valve1 l1)
   goals met: 1 of 5
19. (empty_box r1 b4 valve1 l1 ws1)
   deleted: (contains b4 valve1) (ats valve1 l1)
   added: (empty b4) (has ws1 valve1)
   goals met: 1 of 5
20. (valve_acquired ws1 valve1)
   added: (has_valve ws1)
   goals met: 2 of 5
21. (move_robot r1 l1 centralwarehouse)
   deleted: (free centralwarehouse) (atr r1 l1)
   added: (free l1) (atr r1 centralwarehouse)
   goals met: 3 of 5
22. (pick_box_from_location r1 b6 centralwarehouse)
   deleted: (atbl b6 centralwarehouse)
   added: (carries r1 b6) (loaded r1)
   goals met: 3 of 5
23. (move_box_and_robot r1 centralwarehouse l3 b6)
   deleted: (free l3) (atr r1 centralwarehouse)
   added: (free centralwarehouse) (atr r1 l3) (atbl b6 l3)
   goals met: 2 of 5
24. (deliver_box_to_ws r1 b6 ws3 l3 bolt1)
   deleted: (loaded r1) (carries r1 b6) (atbl b6 l3)
   added: (atbw b6 ws3) (box_delivered b6 ws3) (ats bolt1 l3)
   goals met: 2 of 5
25. (empty_box r1 b6 bolt1 l3 ws3)
   deleted: (contains b6 bolt1) (ats bolt1 l3)
   added: (empty b6) (has ws3 bolt1)
   goals met: 2 of 5
26. (bolt_acquired ws3 bolt1)
   added: (has_bolt ws3)
   goals met: 3 of 5
27. (tool_acquired ws2 tool6)
   added: (has_tool ws2)
   goals met: 4 of 5
28. (move_robot r1 l3 centralwarehouse)
   deleted: (free centralwarehouse) (atr r1 l3)
   added: (free l3) (atr r1 centralwarehouse)
   goals met: 5 of 5
